import pandas as pd
from base_reconstruction_engine import BaseReconstructionEngine
from reconstruction_utils import reconstruct_from_base_df


class JinsIfradiEngine(BaseReconstructionEngine):
    SHEET_NAME = 'الجنس الإفرادي'

    @classmethod
    def make_df(cls):
        data = [
            {
                "الأداة": "ماء",
                "القالب/التركيب": "اسم جنس إفرادي",
                "الفونيمات": " ".join(list("ماء")),
                "الحركات": "",
                "الأثر الإعرابي": "مرفوع أو منصوب أو مجرور",
                "شرط/سياق": "يدل على الجنس الإفرادي",
                "الحالة الإعرابية": "حسب الموقع",
                "الوظيفة النحوية": "اسم جنس إفرادي",
                "الوظيفة الدلالية": "يدل على المفرد",
                "الوظيفة الصرفية": "اسم جامد",
                "الوظيفة الصوتية": "ميم في البداية",
                "الوظيفة الاشتقاقية": "غير مشتق",
                "ملاحظات": "يستخدم للدلالة على المفرد"
            },
            {
                "الأداة": "تراب",
                "القالب/التركيب": "اسم جنس إفرادي",
                "الفونيمات": " ".join(list("تراب")),
                "الحركات": "",
                "الأثر الإعرابي": "مرفوع أو منصوب أو مجرور",
                "شرط/سياق": "يدل على الجنس الإفرادي",
                "الحالة الإعرابية": "حسب الموقع",
                "الوظيفة النحوية": "اسم جنس إفرادي",
                "الوظيفة الدلالية": "يدل على المفرد",
                "الوظيفة الصرفية": "اسم جامد",
                "الوظيفة الصوتية": "تاء في البداية",
                "الوظيفة الاشتقاقية": "غير مشتق",
                "ملاحظات": "يستخدم للدلالة على المفرد"
            },
            {
                "الأداة": "ذهب",
                "القالب/التركيب": "اسم جنس إفرادي",
                "الفونيمات": " ".join(list("ذهب")),
                "الحركات": "",
                "الأثر الإعرابي": "مرفوع أو منصوب أو مجرور",
                "شرط/سياق": "يدل على الجنس الإفرادي",
                "الحالة الإعرابية": "حسب الموقع",
                "الوظيفة النحوية": "اسم جنس إفرادي",
                "الوظيفة الدلالية": "يدل على المفرد",
                "الوظيفة الصرفية": "اسم جامد",
                "الوظيفة الصوتية": "ذال في البداية",
                "الوظيفة الاشتقاقية": "غير مشتق",
                "ملاحظات": "يستخدم للدلالة على المفرد"
            },
            {
                "الأداة": "فضة",
                "القالب/التركيب": "اسم جنس إفرادي",
                "الفونيمات": " ".join(list("فضة")),
                "الحركات": "",
                "الأثر الإعرابي": "مرفوع أو منصوب أو مجرور",
                "شرط/سياق": "يدل على الجنس الإفرادي",
                "الحالة الإعرابية": "حسب الموقع",
                "الوظيفة النحوية": "اسم جنس إفرادي",
                "الوظيفة الدلالية": "يدل على المفرد",
                "الوظيفة الصرفية": "اسم جامد",
                "الوظيفة الصوتية": "فاء في البداية",
                "الوظيفة الاشتقاقية": "غير مشتق",
                "ملاحظات": "يستخدم للدلالة على المفرد"
            },
            {
                "الأداة": "حديد",
                "القالب/التركيب": "اسم جنس إفرادي",
                "الفونيمات": " ".join(list("حديد")),
                "الحركات": "",
                "الأثر الإعرابي": "مرفوع أو منصوب أو مجرور",
                "شرط/سياق": "يدل على الجنس الإفرادي",
                "الحالة الإعرابية": "حسب الموقع",
                "الوظيفة النحوية": "اسم جنس إفرادي",
                "الوظيفة الدلالية": "يدل على المفرد",
                "الوظيفة الصرفية": "اسم جامد",
                "الوظيفة الصوتية": "حاء في البداية",
                "الوظيفة الاشتقاقية": "غير مشتق",
                "ملاحظات": "يستخدم للدلالة على المفرد"
            },
            {
                "الأداة": "هواء",
                "القالب/التركيب": "اسم جنس إفرادي",
                "الفونيمات": " ".join(list("هواء")),
                "الحركات": "",
                "الأثر الإعرابي": "مرفوع أو منصوب أو مجرور",
                "شرط/سياق": "يدل على الجنس الإفرادي",
                "الحالة الإعرابية": "حسب الموقع",
                "الوظيفة النحوية": "اسم جنس إفرادي",
                "الوظيفة الدلالية": "يدل على المفرد",
                "الوظيفة الصرفية": "اسم جامد",
                "الوظيفة الصوتية": "هاء في البداية",
                "الوظيفة الاشتقاقية": "غير مشتق",
                "ملاحظات": "غاز طبيعي"
            },
            {
                "الأداة": "زيت",
                "القالب/التركيب": "اسم جنس إفرادي",
                "الفونيمات": " ".join(list("زيت")),
                "الحركات": "",
                "الأثر الإعرابي": "مرفوع أو منصوب أو مجرور",
                "شرط/سياق": "يدل على الجنس الإفرادي",
                "الحالة الإعرابية": "حسب الموقع",
                "الوظيفة النحوية": "اسم جنس إفرادي",
                "الوظيفة الدلالية": "يدل على المفرد",
                "الوظيفة الصرفية": "اسم جامد",
                "الوظيفة الصوتية": "زاي في البداية",
                "الوظيفة الاشتقاقية": "غير مشتق",
                "ملاحظات": "مادة دهنية"
            },
            {
                "الأداة": "شمع",
                "القالب/التركيب": "اسم جنس إفرادي",
                "الفونيمات": " ".join(list("شمع")),
                "الحركات": "",
                "الأثر الإعرابي": "مرفوع أو منصوب أو مجرور",
                "شرط/سياق": "يدل على الجنس الإفرادي",
                "الحالة الإعرابية": "حسب الموقع",
                "الوظيفة النحوية": "اسم جنس إفرادي",
                "الوظيفة الدلالية": "يدل على المفرد",
                "الوظيفة الصرفية": "اسم جامد",
                "الوظيفة الصوتية": "شين في البداية",
                "الوظيفة الاشتقاقية": "غير مشتق",
                "ملاحظات": "مادة شمعية"
            },
        ]
        dataframe = pd.DataFrame(data)
        return reconstruct_from_base_df(dataframe)
