import pandas as pd
from base_reconstruction_engine import BaseReconstructionEngine
from reconstruction_utils import reconstruct_from_base_df


class KainatGhairAqilaEngine(BaseReconstructionEngine):
    SHEET_NAME = 'الكائنات غير العاقلة'

    @classmethod
    def make_df(cls):
        names = ["أسد","نمر","فهد","ذئب","ثعلب","دب","فيل","جمل","حصان","بغل","حمار","بقرة","ثور","عجل","غنم","ماعز","خنزير","أرنب","قرد","شمبانزي","خفاش","فأر","جرذ","غراب","عصفور","حمامة","ديك","دجاجة","كتكوت","طااووس","نسّاج","بوم","نورس","صقر","نسر","حمام زاجل","بلبل","عندليب","يمامة","بط","إوز","نعامة","أفعى","تِمساح","سلحفاة","ضفدع","عقرب","سحلية","سمك","قرش","حوت","دلفين","إخطبوط","سلطعون","روبيان","نحل","بعوض","ذباب","نمل","جراد","دبور","فراشة","يعسوب"]
        data = []
        for name in names:
            data.append({
                "الأداة": name,
                "القالب/التركيب": "مفرد/جمع",
                "الفونيمات": " ".join(list(str(name))),
                "الحركات": "",
                "شرط/سياق": "يستخدم كاسم كائن غير عاقل",
                "الوظيفة النحوية": "اسم كائن غير عاقل",
                "الوظيفة الدلالية": "دلالة على كائن غير عاقل",
                "الوظيفة الصرفية": "جامد غالبًا",
                "الوظيفة الصوتية": "اسم صوتي واضح",
                "الوظيفة الاشتقاقية": "جامد غالبًا",
                "ملاحظات": "اسم كائن غير عاقل"
            })
        dataframe = pd.DataFrame(data)
        return reconstruct_from_base_df(dataframe)
